app/views/lists/index.html.erb

  <ul>
    <% current_user.lists.each do |list| %>
---
SELECT "lists".* FROM "lists"  WHERE "lists"."user_id" = ?  [["user_id", 3]]