app/views/lists/show.html.erb

SELECT "todo_items".* FROM "todo_items"  WHERE "todo_items"."list_id" = ?  [["list_id", 2]]
---
    <ul class="list-unstyled">
      <% @list.todo_items.each do |t| %>