app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)
<<<<<<< HEAD
    @list.user = current_user

    if @list.save
      flash[:notice] = "Your list has been created!"
      redirect_to lists_path
=======
    @list.user = User.first
---
INSERT INTO "lists" ("title", "user_id") VALUES (?, ?)  [["title", "Homework"], ["user_id", 6]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 6]]

  def destroy
<<<<<<< HEAD
    if @list.destroy
---
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]