app/controllers/todo_items_controller.rb

  def create
    @list = List.find(params[:list_id])
    @todo_item = @list.todo_items.build(params.require(:todo_item).permit(:item))
    @todo_item.user = current_user
    @todo_item.save
---
SELECT  "lists".* FROM "lists"  WHERE "lists"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "todo_items" ("created_at", "item", "list_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-04-06 17:38:46.561628"], ["item", "diapers"], ["list_id", 1], ["updated_at", "2015-04-06 17:38:46.561628"], ["user_id", 1]]

  def complete
    params[:todos_checkbox].each do |check|
      todo_id = check
      t = TodoItem.find_by_id(todo_id)
      t.update_attribute(:completed, true)
---
SELECT  "todo_items".* FROM "todo_items"  WHERE "todo_items"."id" = 1 LIMIT 1
UPDATE "todo_items" SET "completed" = ?, "updated_at" = ? WHERE "todo_items"."id" = 1  [["completed", "t"], ["updated_at", "2015-04-21 02:11:56.114911"]]